# core
brew "ack"
brew "autoconf"
brew "automake"
brew "boot2docker"
brew "git"
brew "imagemagick"
brew "libjpeg"
brew "openssl"
brew "tmux"
brew "wget"
brew "zlib"

# addons
brew "chromedriver"
brew "markdown"
brew "selenium-server-standalone"

# databases
brew "mysql", restart_service: true
brew "postgres", restart_service: true
brew "redis", restart_service: true

# configs
cask_args appdir: "/Applications"
tap "caskroom/cask"

# apps
cask "macvim"
cask "slack"

# language and build tools - jvm
cask "java"
brew "sbt"
brew "scala"

# language and build tools - node
brew "node"
brew "yarn"

# language and build tools - python
brew "pyenv"
brew "python"

# language and build tools - ruby
brew "rbenv"
brew "ruby-build"
