# core
brew "ack"
brew "autoconf"
brew "automake"
brew "boot2docker"
brew "git"
brew "imagemagick"
brew "libjpeg"
brew "openssl"
brew "tmux"
brew "wget"
brew "zlib"

# addons
brew "chromedriver"
brew "markdown"
brew "selenium-server-standalone"
brew "the_silver_searcher"

# databases
brew "mysql" #, restart_service: true
brew "postgres" #, restart_service: true
brew "redis" #, restart_service: true

# app
cask_args appdir: "/Applications"
tap "caskroom/cask"
cask "macvim"
cask "slack"

# language and build tools - jvm
brew "ant"
cask "eclipse-java"
brew "gradle"
brew "grails"
cask "java"
brew "maven"
brew "sbt"
brew "scala"

# language and build tools - jvm -- tap new cask
tap "pivotal/tap"
brew "springboot"

# language and build tools - node
brew "node"
brew "yarn"

# language and build tools - python
brew "pyenv"
brew "python"

# language and build tools - ruby
brew "rbenv"
brew "ruby-build"
