# coinfigs
cask_args appdir: "/Applications"
tap "caskroom/cask"

# core
brew "ack"
brew "autoconf"
brew "automake"
brew "boot2docker"
brew "git"
brew "imagemagick"
brew "libjpeg"
brew "openssl"
brew "tmux"
brew "wget"
brew "zlib"
brew "zsh"
brew "zsh-completions"

# dot file management
tap "thoughtbot/formulae"
brew "rcm"

# addons
brew "chromedriver"
brew "markdown"
brew "selenium-server-standalone"
cask "spectacle"
brew "the_silver_searcher"

# databases
brew "mysql"      #, restart_service: true
brew "postgres"   #, restart_service: true
brew "redis"      #, restart_service: true

# instal java since it's a dependency
tap "caskroom/cask"
cask "java"

# app
cask "atom"
cask "brave"
cask "google-chrome"
cask "macvim"
cask "slack"

# language and build tools - jvm
brew "ant"
cask "eclipse-java"
brew "gradle"
brew "grails"
cask "intellij-idea"
brew "maven"
brew "sbt"
brew "scala"

# language and build tools - jvm -- tap new cask
tap "pivotal/tap"
brew "springboot"

# language and build tools - node
brew "node"
brew "yarn"

# language and build tools - python
brew "pyenv"
brew "python"

# language and build tools - ruby
brew "rbenv"
brew "ruby-build"

# language - php
tap "homebrew/dupes"
tap "homebrew/versions"
tap "homebrew/homebrew-php"
brew "php70"

# server tools
brew "ansible"
